# IMPORT LIBRARY

In [51]:
import pandas as pd
import os
import string
import datetime

# Data Introduction

In [52]:
df = pd.read_csv('csv/Regresi A5.csv')
df.head()

,periode_data,bulan,tanggal,stasiun,karbon_monoksida
0,202401,1,1,DKI5 Kebon Jeruk Jakarta Barat,18.0
1,202401,1,2,DKI5 Kebon Jeruk Jakarta Barat,9.0
2,202401,1,3,DKI5 Kebon Jeruk Jakarta Barat,7.0
3,202401,1,4,DKI5 Kebon Jeruk Jakarta Barat,10.0
4,202401,1,5,DKI5 Kebon Jeruk Jakarta Barat,15.0

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 547 entries, 0 to 546
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   periode_data      547 non-null    int64
 1   bulan             547 non-null    int64
 2   tanggal           547 non-null    int64
 3   stasiun           547 non-null    object
 4   karbon_monoksida  545 non-null    float64
dtypes: float64(1), int64(3), object(1)
memory usage: 21.5+ KB

In [54]:
df.describe(include='all')

,periode_data,bulan,tanggal,stasiun,karbon_monoksida
count,547.000000,547.000000,547.000000,547,545.000000
unique,NaN,NaN,NaN,2,NaN
top,NaN,NaN,NaN,DKI5 Kebon Jeruk Jakarta Barat,NaN
freq,NaN,NaN,NaN,335,NaN
mean,202438.608775,5.519196,15.705667,NaN,15.921101
std,45.779098,3.310143,8.794730,NaN,7.186794
min,202401.000000,1.000000,1.000000,NaN,2.000000
25%,202405.000000,3.000000,8.000000,NaN,10.000000
50%,202409.000000,5.000000,16.000000,NaN,17.000000
75%,202502.000000,8.000000,23.000000,NaN,21.000000
max,202506.000000,12.000000,31.000000,NaN,57.000000

In [55]:
df.isnull().sum()

periode_data        0
bulan               0
tanggal             0
stasiun             0
karbon_monoksida    2
dtype: int64

In [56]:
data_duplicated = df.duplicated().sum()
print("Total Duplicate Data:", data_duplicated)

Total Duplicate Data: 0

# EDA

## Extract Year from periode_data

In [57]:
df['periode_data'] = df['periode_data'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 547 entries, 0 to 546
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   periode_data      547 non-null    object
 1   bulan             547 non-null    int64
 2   tanggal           547 non-null    int64
 3   stasiun           547 non-null    object
 4   karbon_monoksida  545 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 21.5+ KB

In [60]:
df['periode_data'] = df['periode_data'].str[:4]
df = df.rename(columns={'periode_data': 'tahun'})
df.head()

  tahun  bulan  tanggal                           stasiun  karbon_monoksida
0  2024      1        1  DKI5  Kebon Jeruk  Jakarta Barat              18.0
1  2024      1        2  DKI5  Kebon Jeruk  Jakarta Barat               9.0
2  2024      1        3  DKI5  Kebon Jeruk  Jakarta Barat               7.0
3  2024      1        4  DKI5  Kebon Jeruk  Jakarta Barat              10.0
4  2024      1        5  DKI5  Kebon Jeruk  Jakarta Barat              15.0

## Handling Missing Value

In [63]:
df.isnull().sum()

tahun               0
bulan               0
tanggal             0
stasiun             0
karbon_monoksida    2
dtype: int64

In [64]:
df.head()

  tahun  bulan  tanggal                           stasiun  karbon_monoksida
0  2024      1        1  DKI5  Kebon Jeruk  Jakarta Barat              18.0
1  2024      1        2  DKI5  Kebon Jeruk  Jakarta Barat               9.0
2  2024      1        3  DKI5  Kebon Jeruk  Jakarta Barat               7.0
3  2024      1        4  DKI5  Kebon Jeruk  Jakarta Barat              10.0
4  2024      1        5  DKI5  Kebon Jeruk  Jakarta Barat              15.0

### Handling karbon_monoksida

In [65]:
df['karbon_monoksida'] = df['karbon_monoksida'].fillna(method='ffill')
df.head()

<ipython-input-65-c3136b48e99c>:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['karbon_monoksida'] = df['karbon_monoksida'].fillna(method='ffill')

  tahun  bulan  tanggal                           stasiun  karbon_monoksida
0  2024      1        1  DKI5  Kebon Jeruk  Jakarta Barat              18.0
1  2024      1        2  DKI5  Kebon Jeruk  Jakarta Barat               9.0
2  2024      1        3  DKI5  Kebon Jeruk  Jakarta Barat               7.0
3  2024      1        4  DKI5  Kebon Jeruk  Jakarta Barat              10.0
4  2024      1        5  DKI5  Kebon Jeruk  Jakarta Barat              15.0

In [66]:
df.isnull().sum()

tahun               0
bulan               0
tanggal             0
stasiun             0
karbon_monoksida    0
dtype: int64

In [67]:
df.head()

  tahun  bulan  tanggal                           stasiun  karbon_monoksida
0  2024      1        1  DKI5  Kebon Jeruk  Jakarta Barat              18.0
1  2024      1        2  DKI5  Kebon Jeruk  Jakarta Barat               9.0
2  2024      1        3  DKI5  Kebon Jeruk  Jakarta Barat               7.0
3  2024      1        4  DKI5  Kebon Jeruk  Jakarta Barat              10.0
4  2024      1        5  DKI5  Kebon Jeruk  Jakarta Barat              15.0

In [69]:
by_year= df.groupby('tahun').count()
by_year

       bulan  tanggal  stasiun  karbon_monoksida
tahun
2024     366      366      366               366
2025     181      181      181               181

# EXPORT AS FINAL DATASET

In [ ]:
def save_to_csv(df, path: str):
    try:
        os.makedirs('csv', exist_ok=True)
        file_path = os.path.join('csv', path)
        df.to_csv(file_path, index=False)
        print(f"Data saved to {file_path}")

    except Exception as e:
        print(f"Failed to save CSV: {e}")

In [ ]:
file_name= 'Regresi A5_final.csv'
save_to_csv(df, file_name)

Data saved to csv\Regresi A5_final.csv